# todo: 10.1 Дано целое число A. Проверить истинность высказывания: «Число A является четным».
# todo: 10.2 Дано целое число A. Проверить истинность высказывания: «Число A является нечетным».
# Примечание: В задании  требуется вывести логическое значение True, если выражение
# для введеных исходных данных является истинным, и значение False в противном случае.

A = int(input ('Введите число А: '))

even = True if A % 2 == 0 else False
print ('Число А является чётным? ' + str(even))

odd = False if A % 2 == 0 else True
print ('Число А является нечётным? ' + str(odd))